benchmark/k6/results/OnPrem_LoadTest_LargePL_2025-02-25T16:36:58.log
Execution Setup
{
  "testName": "OnPrem_LoadTest_LargePL",
  "host": "192.168.1.182",
  "options": {
    "insecureSkipTLSVerify": true,
    "stages": [
      {
        "duration": "2m",
        "target": 350
      },
      {
        "duration": "1m",
        "target": 350
      },
      {
        "duration": "2m",
        "target": 0
      }
    ]
  },
  "multiplier": 100,
  "text": "In an era defined by rapid innovation and global interconnectivity, humanity finds itself at the crossroads of technology and tradition. Modern advancements in computing, medicine, and environmental science have redefined possibilities, enabling breakthroughs once thought impossible. As digital networks weave communities together, ethical debates and sustainable practices emerge as critical priorities. Scholars, engineers, and policymakers collaborate to harness artificial intelligence and renewable energy, ensuring progress benefits society at large. Cultural heritage and scientific discovery now coexist in a delicate balance, challenging us to honor the past while forging new paths. Every discovery, from quantum computing to gene editing, invites both excitement and caution, urging responsible innovation and shared wisdom for a brighter future. With each milestone, the narrative of progress deepens, inspiring a commitment to knowledge, empathy, and perseverance that transcends borders and generations. This comprehensive journey through scientific and cultural evolution illustrates how collective effort and visionary thinking drive society forward. The integration of diverse perspectives fosters innovation, while respect for natural systems ensures that progress remains sustainable and inclusive. As challenges arise and new opportunities emerge, the interplay between technology and human values continues to shape our shared destiny, reminding us that every step forward is a testament to our capacity for adaptation and hope.",
  "sleep": 0
}

----------------------------------------

Running gRPC Auto Migration via Framework...
         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 
     execution: local
        script: grpc-auto-test.js
        output: -
     scenarios: (100.00%) 1 scenario, 350 max VUs, 5m30s max duration (incl. graceful stop):
              * default: Up to 350 looping VUs for 5m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)
     ✓ status is OK
     checks...............: 100.00% 4491 out of 4491
     data_received........: 699 MB  2.3 MB/s
     data_sent............: 9.1 MB  30 kB/s
     grpc_req_duration....: avg=12.36s min=80.51ms med=8.46s  max=1m51s p(90)=28.44s p(95)=36.18s
     iteration_duration...: avg=14.53s min=99.89ms med=10.65s max=1m54s p(90)=31.84s p(95)=39.81s
     iterations...........: 4491    14.967534/s
     vus..................: 1       min=1            max=350
     vus_max..............: 350     min=350          max=350
----------------------------------------

Running gRPC Manual Migration...
         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 
     execution: local
        script: grpc-manual-test.js
        output: -
     scenarios: (100.00%) 1 scenario, 350 max VUs, 5m30s max duration (incl. graceful stop):
              * default: Up to 350 looping VUs for 5m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)
     ✓ status is OK
     checks...............: 100.00% 4568 out of 4568
     data_received........: 711 MB  2.4 MB/s
     data_sent............: 9.2 MB  31 kB/s
     grpc_req_duration....: avg=12.17s min=66.1ms  med=8.46s  max=1m41s p(90)=27.57s p(95)=36s   
     iteration_duration...: avg=14.25s min=85.75ms med=10.44s max=1m46s p(90)=30.97s p(95)=40.17s
     iterations...........: 4568    15.225096/s
     vus..................: 1       min=1            max=350
     vus_max..............: 350     min=350          max=350
----------------------------------------

Running HTTP REST Existing API...
         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 
     execution: local
        script: http-test.js
        output: -
     scenarios: (100.00%) 1 scenario, 350 max VUs, 5m30s max duration (incl. graceful stop):
              * default: Up to 350 looping VUs for 5m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)
     ✗ status is 200
      ↳  98% — ✓ 4500 / ✗ 84
     checks.........................: 98.16% 4500 out of 4584
     data_received..................: 709 MB 2.4 MB/s
     data_sent......................: 7.9 MB 27 kB/s
     http_req_blocked...............: avg=120.4ms  min=792ns   med=2.94µs max=5.38s   p(90)=9.24µs  p(95)=1.02s  
     http_req_connecting............: avg=120.39ms min=0s      med=0s     max=5.38s   p(90)=0s      p(95)=1.02s  
     http_req_duration..............: avg=14.21s   min=62.56ms med=9.72s  max=1m0s    p(90)=34.19s  p(95)=44.23s 
       { expected_response:true }...: avg=13.42s   min=62.56ms med=9.51s  max=59.73s  p(90)=32.21s  p(95)=39.87s 
     http_req_failed................: 1.83%  84 out of 4584
     http_req_receiving.............: avg=12.3s    min=0s      med=8.17s  max=59.2s   p(90)=30.72s  p(95)=40.81s 
     http_req_sending...............: avg=18.47µs  min=4.78µs  med=13.9µs max=217.9µs p(90)=29.35µs p(95)=49.73µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s     max=0s      p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=1.9s     min=11.32ms med=1.03s  max=48.08s  p(90)=4.29s   p(95)=5.97s  
     http_reqs......................: 4584   15.278291/s
     iteration_duration.............: avg=14.33s   min=62.67ms med=9.91s  max=1m0s    p(90)=34.41s  p(95)=44.58s 
     iterations.....................: 4584   15.278291/s
     vus............................: 1      min=1            max=350
     vus_max........................: 350    min=350          max=350
----------------------------------------

All tests completed. See 'results/OnPrem_LoadTest_LargePL_2025-02-25T16:36:58.log' for details.